## Plan Result (Aks_demo)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_role_assignment.disk
* Update
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster.kubernetes_cluster




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-demo-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
    }

  # azurerm_role_assignment.disk will be created
  + resource "azurerm_role_assignment" "disk" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a16e4c77-50e4-467f-9a3f-6b5f809b271d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
        id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks"
        name                                = "cft-demo-00-aks"
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (37 unchanged attributes hidden)

      ~ default_node_pool {
          ~ max_count                     = 10 -> 12
            name                          = "system"
            tags                          = {
                "application"  = "core"
                "autoShutdown" = "true"
                "builtFrom"    = "hmcts/aks-cft-deploy"
                "businessArea" = "CFT"
                "criticality"  = "Medium"
                "environment"  = "demo"
            }
            # (30 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
        id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-01-aks"
        name                                = "cft-demo-01-aks"
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (37 unchanged attributes hidden)

      ~ default_node_pool {
          ~ max_count                     = 10 -> 12
            name                          = "system"
            tags                          = {
                "application"  = "core"
                "autoShutdown" = "true"
                "builtFrom"    = "hmcts/aks-cft-deploy"
                "businessArea" = "CFT"
                "criticality"  = "Medium"
                "environment"  = "demo"
            }
            # (30 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.disks_resource_group has been deleted
  - resource "azurerm_resource_group" "disks_resource_group" {
      - id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/disks-demo-rg" -> null
        name       = "disks-demo-rg"
        tags       = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":667,"Program":"tfcmt","SHA1":"","Target":"Aks_demo","Vars":{}} -->